; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v7 ?v5)
             (pred_12 ?v8 ?v6)
             (pred_11 ?v7 ?v6)
             (pred_10 ?v13 ?v7 )
	     (pred_4 ?v7)
             (pred_5 ?v1)
             (pred_7 ?v8)
             (pred_9 ?v6)
             (pred_1 ?v7)
             (pred_3 ?v8)
             (pred_6 ?v7)
             (pred_8 ))



(:action op_3
:parameters (?v4 ?v10 ?v12 ?v2)
:precondition (and (pred_5 ?v4) (pred_5 ?v10) (pred_7 ?v12) (pred_9 ?v2)
          (pred_2 ?v4 ?v10) (pred_12 ?v12 ?v2)
                   (pred_11 ?v10 ?v2) (pred_4 ?v4) 
                   (pred_1 ?v10) (pred_3 ?v12))
:effect (and  (pred_6 ?v10) (not (pred_1 ?v10))))


(:action op_1
:parameters (?v4 ?v9)
:precondition (and (pred_5 ?v4) (pred_5 ?v9)
               (pred_4 ?v4) (pred_2 ?v4 ?v9) (pred_6 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v4))))

(:action op_5
:parameters (?v4 ?v12)
:precondition (and (pred_5 ?v4) (pred_7 ?v12) 
                  (pred_4 ?v4) (pred_10 ?v12 ?v4) (pred_8 ))
:effect (and (pred_3 ?v12)
   (not (pred_10 ?v12 ?v4)) (not (pred_8 ))))


(:action op_4
:parameters (?v4 ?v11 ?v3)
:precondition (and (pred_5 ?v4) (pred_7 ?v11) (pred_7 ?v3)
                  (pred_4 ?v4) (pred_3 ?v3) (pred_10 ?v11 ?v4))
:effect (and (pred_3 ?v11) (pred_10 ?v3 ?v4)
        (not (pred_3 ?v3)) (not (pred_10 ?v11 ?v4))))

(:action op_2
:parameters (?v4 ?v12)
:precondition (and (pred_5 ?v4) (pred_7 ?v12) 
                  (pred_4 ?v4) (pred_3 ?v12))
:effect (and (pred_8 ) (pred_10 ?v12 ?v4) (not (pred_3 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_08 obj_05 obj_18 obj_16 obj_10 obj_02 obj_17 obj_06 obj_19 obj_13 obj_21 obj_15 obj_12 obj_04 obj_11
    obj_09 obj_20
    obj_14 obj_01 obj_03
    )

    (:init
       (pred_8)

       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_10)
       (pred_5 obj_02)
       (pred_5 obj_17)
       (pred_5 obj_06)
       (pred_5 obj_19)
       (pred_5 obj_13)
       (pred_5 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_20)
       (pred_7 obj_14)
       (pred_7 obj_01)
       (pred_7 obj_03)

       (pred_2 obj_07 obj_16)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_05)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_05 obj_02)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_05 obj_08)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_16 obj_06)
       (pred_2 obj_16 obj_10)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_10 obj_19)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_10 obj_16)
       (pred_2 obj_02 obj_13)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_02 obj_05)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_17 obj_21)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_06 obj_16)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_19 obj_10)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_02)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_21 obj_11)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_12 obj_04)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_04 obj_12)
       (pred_2 obj_11 obj_21)
       (pred_2 obj_11 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_11  obj_02 obj_09)
       (pred_11  obj_07 obj_20)
       (pred_11  obj_08 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_06)
       (pred_6 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_15)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_11)

       (pred_12  obj_14 obj_09)
       (pred_12  obj_01 obj_20)
       (pred_12  obj_03 obj_20)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_03 obj_18)
       (pred_4 obj_11)
    )

    (:goal (and
       (pred_10 obj_01 obj_16)
    ))
(:constraints
  (always (not (pred_4 obj_19)))
)
)

; plan
1. (op_1 obj_11 obj_21)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_21)
   goals met: 0 of 1
2. (op_1 obj_21 obj_17)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_17)
   goals met: 0 of 1
3. (op_5 obj_17 obj_01)
   deleted: (pred_10 obj_01 obj_17) (pred_8)
   added: (pred_3 obj_01)
   goals met: 0 of 1
4. (op_1 obj_17 obj_21)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_21)
   goals met: 0 of 1
5. (op_1 obj_21 obj_13)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_13)
   goals met: 0 of 1
6. (op_1 obj_13 obj_04)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_04)
   goals met: 0 of 1
7. (op_1 obj_04 obj_12)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_15)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_15)
   goals met: 0 of 1
9. (op_1 obj_15 obj_06)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_06)
   goals met: 0 of 1
10. (op_1 obj_06 obj_16)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_16)
   goals met: 0 of 1
11. (op_2 obj_16 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_8) (pred_10 obj_01 obj_16)
   goals met: 1 of 1
